EDT/MPCurier/src/Documents/УстановкаСтатусаЗаказаПрочее/УстановкаСтатусаЗаказаПрочее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСтатусаЗаказаПрочее</name>
  <registerRecords>InformationRegister.СтатусыЗаказов</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>CatalogRef.Заказ</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДоставки</name>
    <type>
      <types>CatalogRef.РезультатыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейс</types>
    </type>
  </attributes>
</mdclass:Document>

EDT/MPCurier/src/InformationRegisters/СтатусыЗаказов/СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.РезультатыДоставки</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>CatalogRef.Заказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/MPCurier/src/Documents/УстановкаСтатусаЗаказаПрочее/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр СтатусыЗаказов
	Движения.СтатусыЗаказов.Записывать = Истина;
	Движение = Движения.СтатусыЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Заказ = Заказ;
	Движение.Рейс = Рейс;
	Движение.РезультатДоставки = СтатусДоставки;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ	
КонецПроцедуры
#КонецОбласти
